# Pandas Intro

In [66]:
import pandas as pd

In [67]:
df = pd.read_csv('bank-full.csv')
type(df)

pandas.core.frame.DataFrame

In [68]:
print(df.info())
df.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 1 columns):
age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"    45211 non-null object
dtypes: object(1)
memory usage: 353.3+ KB
None

(45211, 1)

In [69]:
df.head()

  age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0  58;"management";"married";"tertiary";"no";2143...
1  44;"technician";"single";"secondary";"no";29;"...
2  33;"entrepreneur";"married";"secondary";"no";2...
3  47;"blue-collar";"married";"unknown";"no";1506...
4  33;"unknown";"single";"unknown";"no";1;"no";"n...

In [70]:
df = pd.read_csv('bank-full.csv', sep=';')

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
age          45211 non-null int64
job          45211 non-null object
marital      45211 non-null object
education    45211 non-null object
default      45211 non-null object
balance      45211 non-null int64
housing      45211 non-null object
loan         45211 non-null object
contact      45211 non-null object
day          45211 non-null int64
month        45211 non-null object
duration     45211 non-null int64
campaign     45211 non-null int64
pdays        45211 non-null int64
previous     45211 non-null int64
poutcome     45211 non-null object
y            45211 non-null object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [72]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [73]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [74]:
df.education.head()

0     tertiary
1    secondary
2    secondary
3      unknown
4      unknown
Name: education, dtype: object

In [75]:
education_s = df['education']
print(education.head())
type(education)

   education
0   tertiary
1  secondary
2  secondary
3    unknown
4    unknown

pandas.core.frame.DataFrame

In [76]:
education_df = df[['education']]
print(education.head())
type(education)

   education
0   tertiary
1  secondary
2  secondary
3    unknown
4    unknown

pandas.core.frame.DataFrame

In [77]:
df.loc[2,'education']

'secondary'

In [78]:
df.iloc[2, 3]

'secondary'

In [83]:
df.loc[:,"age":"education"].head()

   age           job  marital  education
0   58    management  married   tertiary
1   44    technician   single  secondary
2   33  entrepreneur  married  secondary
3   47   blue-collar  married    unknown
4   33       unknown   single    unknown

In [84]:
df.loc[90:100, ["job", "balance"]]

              job  balance
90     management       50
91     technician      152
92         admin.      290
93    blue-collar       54
94   entrepreneur      -37
95     management      101
96    blue-collar      383
97        retired       81
98     technician        0
99     management      229
100   blue-collar     -674

# 
Query the columns age, marital, housing and loan between the indexes 245 - 275